tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "python@3.13"
brew "git"
brew "jupyterlab"
brew "numpy"
brew "pipx"
brew "python-matplotlib"
brew "ruff"
brew "scipy"
brew "thefuck"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-jetbrains-mono"
cask "rectangle"
cask "warp"
cask "wezterm"
vscode "ms-ceintl.vscode-language-pack-ru"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "pkief.material-icon-theme"
vscode "shardulm94.trailing-spaces"
